"""Снабди каждый комментарий правильной командой."""

python -V  # команда для проверки текущей версии Питона
python # запуск интерпретатора Питона в режиме REPL
virtualenv название # создание виртуального окружения в текущей директории
.\Scripts\activate # активация вышесозданного виртуального окружения
deactivate # деактивация виртуального окружения
python run.py # запуск скрипта run.py находящегося в текущей директории
pip install requests # установка пакета requests через пакетный менеджер pip
