"""Задания по стилю кода и именованию переменных."""

# напиши команду, которая проверяет, ссылаются ли
# переменные spam и eggs на один и тот же объект в пямяти
spam = None
eggs = None
print('Same id' if id(spam) == id(eggs) else 'Different id')
# придумай название для переменной, которая хранит список
# активных студентов, оставь этот список пустым
current_students = []
# назови переменную, которая хранит текущее количество студентов в потоке
student_enrolment = 99
# придумай две переменных для обозначения самого маленького и самого большого
# числа в диапазоне и запиши в них числа 1 и 45
smallest_num = 1
biggest_num = 45
# создай константу для хранения числа Пи и запиши в неё первые 10 знаков
PI = 3.1415926535
